import React, { Component } from 'react';
import './Info.css';

export class Info extends Component {
  render () {
    return (
        <div className="info">
            <h1 className="info-title">О нас</h1>
            <p>Перемены в стране не могли не коснуться главной библиотеки страны. В 1992 году Государственная библиотека СССР имени В. И. Ленина преобразована в Российскую государственную библиотеку. Впрочем, большинство читателей продолжает называть её «Ленинка».</p>
            <p>С 1993 года читальные залы Библиотеки после 20-летнего перерыва вновь доступны для всех граждан с 18 лет. А с 2016 года получить читательский билет может любой, кому уже исполнилось 14 лет.</p>
            <p>В 1998 году в РГБ открылся Центр правовой информации.</p>
            <p>В 2000 году была принята Национальная программа сохранения библиотечных фондов России. В её рамках реализуется специальная подпрограмма «Книжные памятники Российской Федерации». Функции Федерального научно-исследовательского, научно-методического и координационного центра по работе с книжными памятниками были возложены на Российскую государственную библиотеку.</p>
            <p>К концу 2016 года объём фондов РГБ составлял около 47 миллионов единиц. Для посетителей работают 36 читальных залов. Ежеминутно двери Библиотеки открывают пять посетителей. За год прибавляется примерно сто тысяч новых пользователей.</p>
            <p>В декабре 2016 года на фундаменте картинной галереи Румянцевского музея открылся новый Ивановский зал, ставший главной выставочной площадкой Российской государственной библиотеки.</p>
            <p>С 1 января 2017 года в Российскую государственную библиотеку начали поступать в электронном виде обязательные экземпляры всех печатных изданий, выходящих в нашей стране. На портале РГБ создана система приёма, обработки, хранения и учёта обязательных электронных экземпляров.</p>
            <p>Ежегодно выпускаемый публичный отчёт подробно показывает, как развивается Российская государственная библиотека.</p>
      </div>
    );
  }
}
